test/newMeshMorphing/moorDynBoxInWaves_v2/originalMeshMorphing/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall1
    {
        type            empty;
        value           uniform (0 0 0);
    }
    wall2
    {
        type            empty;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            fixedNormalSlip;
        n               (0 0 1);
//        type            fixedValue;
//        value           uniform (0 0 0);
    }
    box
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedNormalSlip;
        n               (0 0 1);
//        type            fixedValue;
//        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
