test/newMeshMorphing/moorDynBoxInWaves_v2/originalMeshMorphing/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     floatStepper;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           2;
maxAlphaCo      1;
maxDeltaT       1;


libs    (moorDynForFloatStepper waveModels);

functions
{
   floaterMotion
    {
        type           floaterStateWriter;
        libs           (floaterStateWriter);
        writeControl    timeStep;
        writeInterval   1;
        classicWriteFormat false;
        bodyName        box;
    }
}

// ************************************************************************* //


// ************************************************************************* //
